                                       <? WEB Development info ?>

ვებ დეველოპმენტი იყოფა სამ ნაწილად:

Front-End-Development   	          	        		
Back-End-Development
Full-Stack-Development

დავიწყოთ Front-End-ით , ფრონტ ენდი არის ვებ გვერდი რომელსაც ჩვენ ვხედავთ, ანუ ფრონტ ენდი შედგება დიზაინისგან,


Back end - არის სერვერული მხარე, ბექენდი და მისი კოდი არ ჩანს, მაგალითად ავტორიზაციის გავლა, ნივთის ყიდვა და ა.შ არარის ხილვადი, ბაქენდ დეველოპერს უნდა ესმოდეს რა ენებით იქმნება ვებ აპლიკაცია, ასევე უნდა ესმოდეს მონაცემთა ბაზები, თუ სად ინახება და როგორ ინახება მონაცემი.

ბექენდ დეველოპერმა ასევე კარგად უნდა იცოდეს მარკირების ენა HTML, რადგან მასზე არის აგებული ვებ სტრუქტურა

- User Data : ინახავს მონაცემებს და უზრუნველყოფს რომ მონაცემი იყოს წარდგენილი მხოლოდ იმ მომხმარებელთან რომელსაც აქვს ამ მონაცემთან წვდომის უფლება

-Payment Processing : დაცულად ინახავ მონაცემებს და ახდენ ფულის ჩამოჭრას კარტიდან (ახდენ გადარიცხვებს)

- API (Application Programming Interfaces): რესურსებზე ხელმისაწვდომობა მობილური ტელეფონის აპლიკაციებით და სხვა პროგრამები...

Full Stack Developer -ფულ სტეკ დეველოპერს გააჩნია სრული ცოდნა ვებ დეველოპმენტში ანუ Front-End-იც კარგად იცის და Back-End-იც



ვებ სერვერზე წვდომისთვის და ფუნქციონირებისთვის არსებობს "ვებ სერვერის ძრავები/პროგრამები"

Popular Web Server Softwares / ცნობილი ვებ სერვერის ძრავები 

- Apache 

- NGINX

- Microsoft IIS (Internet Information Services)


Popular Languages for web development :

- JavaScript : არის ფრონტ-ენდ პროგრამული ენა

- Java : სერვერული მხარეა

- Python

- PHP 
 
